# IsLinked Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..IsLinked Property
Document Class See Also
---
Identifies if a document is a linked RVT.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsLinked { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsLinked As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsLinked {
	bool get ();
}
```

# See Also
Document Class
Autodesk.Revit.DB Namespace